package com.example.t035listveiw;

import android.os.Bundle;
import android.support.v7.app.ActionBarActivity;
import android.widget.ArrayAdapter;
import android.widget.ListView;


public class MainActivity extends ActionBarActivity {
	String[] data={"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽",
			"사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","사과","배 ","귤 ","오렌지","바나나","파일애플","오이","수박","자몽"
			}; // 1. 다량의 데이터 
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        
        
        // 다량의 데이터를 표현하는 방법 
        // 1. 다량의 데이터를 준비한다.(배열, xml,ArrayList 객체) 
        // 2. Adapter 정의  : 데이터와 AdapterView 의 연결 관계를 정의 
        // 3. AdaPterView 선택 (ListView, Spinner, GridView... )
        // 		Adapter 를 등록 (setAdapter()메소드 )
        
        
//        ArrayAdapter adapter = new ArrayAdapter(getApplicationContext(),// 현재 화면의 제어권자 
//        						android.R.layout.simple_list_item_1,// 하나의 행마다 보여줄 레이아웃을 지정
//        						data);
        ArrayAdapter adapter = new ArrayAdapter(getApplicationContext(),// 현재 화면의 제어권자 
        		R.layout.myrow,// 하나의 행마다 보여줄 레이아웃을 지정
        		data);
        		
        ListView lv = (ListView) findViewById(R.id.listView1);		
        lv.setAdapter(adapter);// 리스트 뷰의 아답터를 등록한다 .		
        
        
        
        
    } // 


   
} // end Class MainActivity
